{
  "category": "special and corrective pedagogy",
  "isPopular": true,
  "id": "pedagogika-specjalna-edukacja-terapia-i-wspomaganie-osob-z-zaburzeniami-ze-spektrum-autyzmu",
  "title": "Education, Therapy, and Support for Individuals with Autism Spectrum Disorders",
  "banerDescription": "Gain qualifications to work with individuals on the autism spectrum and expand your knowledge in education and therapy.",
  "description": "<ul className=\"list-disc list-inside space-y-2\"><li>Teachers wishing to obtain qualifications to teach a second subject</li><li>Individuals wanting to expand their knowledge in education and therapy for people with autism spectrum disorders</li><li>Specialists interested in working with individuals with autism</li></ul>",
  "description2": "The studies are qualification-oriented, enabling Teachers to obtain the right to teach a second subject. The study program is focused on equipping teachers with substantive knowledge, covering education in the scope necessary to implement the content included in the core curriculum of general education in a given subject.",
  "description3": "The studies provide practical knowledge, gathered through internships, aimed at gaining experiences related to the didactic and educational work of a teacher and confronting the acquired knowledge in the field of didactics with pedagogical reality in practical action.",
  "description4": "",
  "descriptionP1": "",
  "duration": "3 semesters",
  "practicalHours": "180h of internship",
  "price": "3600 PLN",
  "payments": "10 x 360 PLN",
  "scheduleInfo": "",
  "schedule": [
    "26.10.2024",
    "16.11.2024",
    "23.11.2024",
    "30.11.2024",
    "07.12.2024",
    "14.12.2024",
    "11.01.2025",
    "18.01.2025",
    "25.01.2025",
    "15.02.2025",
    "01.03.2025",
    "15.03.2025",
    "22.03.2025",
    "05.04.2025",
    "12.04.2025",
    "10.05.2025",
    "17.05.2025",
    "24.05.2025"
  ],
  "modules": [
    {
      "title": "Introduction to Special Education",
      "topics": [
        { "title": "Foundations of Special Education", "subtopics": [] },
        { "title": "Special Didactics", "subtopics": [] },
        { "title": "Diagnostics in Special Education", "subtopics": [] },
        { "title": "Ethics of the Teaching Profession", "subtopics": [] },
        {
          "title": "Anatomy and Physiology of the Nervous System with Elements of Neurology",
          "subtopics": []
        },
        {
          "title": "Elements of Clinical Psychology and Psychopathology",
          "subtopics": []
        },
        { "title": "Basics of Neuropsychology", "subtopics": [] }
      ]
    },
    {
      "title": "Diagnosis and Therapy of Autism Spectrum Disorders",
      "topics": [
        { "title": "Diagnosis of Autism Spectrum Disorders", "subtopics": [] },
        {
          "title": "Psycho-pedagogical Diagnosis of Students with Autism Spectrum Disorders",
          "subtopics": []
        },
        {
          "title": "Sensory Integration Disorders in Autism Spectrum Disorders",
          "subtopics": []
        },
        {
          "title": "Therapy and Support for the Child's Family",
          "subtopics": []
        },
        {
          "title": "Adolescence and Adulthood Issues in Individuals with Autism Spectrum",
          "subtopics": []
        },
        {
          "title": "Social Functioning of Individuals with Autism Spectrum",
          "subtopics": []
        },
        {
          "title": "Special Needs of Students with Autism Spectrum Disorders",
          "subtopics": []
        }
      ]
    },
    {
      "title": "Methodology of Working with Individuals with Autism",
      "topics": [
        {
          "title": "Augmentative and Alternative Communication Methods",
          "subtopics": []
        },
        {
          "title": "Methodology of Early Development Support for Children with Autism Spectrum",
          "subtopics": []
        },
        {
          "title": "Methodology of Individual Rehabilitation Classes for Students with Autism Spectrum Disorders",
          "subtopics": []
        },
        {
          "title": "Methodology of Activating Classes in School Groups",
          "subtopics": []
        },
        { "title": "Social Skills Training", "subtopics": [] },
        {
          "title": "Supporting Professional Development of Individuals with Autism Spectrum Disorders",
          "subtopics": []
        }
      ]
    },
    {
      "title": "Professional Practice",
      "topics": [
        { "title": "Internship Module I (60 h)", "subtopics": [] },
        { "title": "Internship Module II (120 h)", "subtopics": [] }
      ]
    }
  ],
  "faculty": "Classes are conducted by experienced practitioners in the field of special education, psychology, and therapy for individuals with autism spectrum disorders.",
  "practices": "<ul className=\"list-disc list-inside space-y-2\"><li>Internship Module I includes 60 hours and focuses on introducing work with individuals with autism.</li><li>Internship Module II includes 120 hours and allows for deepening experience in therapy and education of individuals with autism spectrum.</li><li>Internships can be carried out in special institutions, integrative schools, and therapeutic centers.</li></ul>",
  "evaluation": "Assessment of learning outcomes is based on activity during classes, completion of individual modules, and preparation of a diploma thesis.",
  "jobOpportunities": "<div><p className=\"text-lg font-semibold\">Graduates of the program will be prepared to work as:</p><ul className=\"list-disc list-inside mt-2 space-y-2\"><li>Supporting teachers in integrative and special schools</li><li>Therapists for individuals with autism spectrum disorders</li><li>Education and therapy specialists in special institutions</li><li>Consultants in educational and therapeutic institutions</li><li>Employees of support centers for individuals with autism and their families</li></ul></div>",
  "invite": "<div class=''> <p class='text-gray-100'>Gain the qualifications and skills necessary to work with individuals on the autism spectrum.</p></div>"
}
