{
  "category": "special and corrective education",
  "isPopular": false,
  "id": "pedagogika-specjalna-edukacja-i-rehabilitacja-osob-z-niepelnosprawnoscia-wzrokowa-tyflopedagogika",
  "title": "Education and rehabilitation of people with visual impairments (Tyflopedagogy)",
  "banerDescription": "Gain qualifications to work with blind and visually impaired individuals, supporting their education and rehabilitation.",
  "description": "<ul className=\"list-disc list-inside space-y-2\"><li>Teachers wishing to gain qualifications in visual impairment education</li><li>Individuals working with children and youth with visual impairments</li><li>Educators and psychologists looking to expand their competencies</li><li>Those interested in working with blind and visually impaired individuals</li></ul>",
  "description2": "The aim of the studies is to equip students with specialized knowledge and skills to work with visually impaired and blind children and youth in the field of special psychological and pedagogical preparation, special didactics, as well as to work with adults. The program provides students with knowledge, skills, and social competencies in the areas of methods, forms of education, and basics of rehabilitation needed in therapeutic work with visually impaired and blind individuals.",
  "description3": "The studies prepare staff to carry out educational, therapeutic, and rehabilitation tasks with blind and visually impaired children and youth in special education institutions, integrated schools, and specialized counseling centers.",
  "description4": "",
  "descriptionP1": "",
  "duration": "3 semesters",
  "practicalHours": "180h of internship",
  "price": "3600 PLN",
  "payments": "10 x 360 PLN",
  "scheduleInfo": "",
  "schedule": [
    "26.10.2024",
    "16.11.2024",
    "23.11.2024",
    "30.11.2024",
    "07.12.2024",
    "14.12.2024",
    "11.01.2025",
    "18.01.2025",
    "25.01.2025",
    "15.02.2025",
    "01.03.2025",
    "15.03.2025",
    "22.03.2025",
    "05.04.2025",
    "12.04.2025",
    "10.05.2025",
    "17.05.2025",
    "24.05.2025"
  ],
  "modules": [
    {
      "title": "Specialized Education Module",
      "topics": [
        { "title": "Fundamentals of special education", "subtopics": [] },
        { "title": "Special didactics", "subtopics": [] },
        { "title": "Diagnostics in special education", "subtopics": [] },
        { "title": "Ethics of the teaching profession", "subtopics": [] },
        { "title": "Internship module I (60 h)", "subtopics": [] }
      ]
    },
    {
      "title": "Substantive Preparation",
      "topics": [
        {
          "title": "Anatomy and physiology of the visual system",
          "subtopics": []
        },
        { "title": "Elements of ophthalmology and optometry", "subtopics": [] },
        { "title": "Visual disorders and defects", "subtopics": [] },
        {
          "title": "Elements of psychology of visual impairment",
          "subtopics": []
        },
        {
          "title": "Basic legal regulations for education and rehabilitation of visually impaired individuals",
          "subtopics": []
        },
        { "title": "Visual impairment education", "subtopics": [] },
        {
          "title": "Diagnostics in visual impairment education",
          "subtopics": []
        },
        {
          "title": "Augmentative and alternative communication methods",
          "subtopics": []
        },
        {
          "title": "Methods of support and therapy for visually impaired individuals",
          "subtopics": []
        },
        {
          "title": "Spatial orientation and independent mobility",
          "subtopics": []
        },
        {
          "title": "Braille and alternative reading and writing methods",
          "subtopics": []
        },
        {
          "title": "Methodology of teaching visually impaired students in preschool and early school education",
          "subtopics": []
        },
        {
          "title": "Methodology of educating visually impaired individuals",
          "subtopics": []
        },
        {
          "title": "Assistive technologies in education for visually impaired individuals",
          "subtopics": []
        },
        { "title": "Internship module II (120 h)", "subtopics": [] }
      ]
    }
  ],
  "faculty": "Classes are conducted by experienced practitioners in the fields of visual impairment education, ophthalmology, and psychology, with many years of experience working with blind and visually impaired individuals.",
  "practices": "<ul className=\"list-disc list-inside space-y-2\"><li>Internship module I covers 60 hours and is carried out in semester 1.</li><li>Internship module II covers 120 hours and is carried out in semester 3.</li><li>Internships can be carried out in educational institutions, psychological and pedagogical counseling centers, rehabilitation centers, and other institutions working with visually impaired individuals.</li></ul>",
  "evaluation": "The assessment of learning outcomes is based on activity during classes, completion of individual modules, implementation of internships, and preparation of a diploma thesis.",
  "jobOpportunities": "<div><p className=\"text-lg font-semibold\">Graduates of the program will be prepared to work as:</p><ul className=\"list-disc list-inside mt-2 space-y-2\"><li>Teachers in special, integrated, and mainstream schools</li><li>Specialists in psychological and pedagogical counseling centers</li><li>Therapists in rehabilitation centers</li><li>Visual impairment educators in educational and rehabilitation institutions</li><li>Employees of foundations and associations supporting visually impaired individuals</li></ul></div>",
  "invite": "<div class=''> <p class='text-gray-100'>Gain the qualifications and skills necessary to work with blind and visually impaired individuals, supporting their education and rehabilitation.</p></div>"
}
